INSERT INTO `collect` VALUES (11111111, 'f1', '新鲜柠檬6斤当季水果应季免邮安包邮一岳皮薄小青级香水鲜柠檬', 13.80, '喜欢的水果', '1111', '1');
INSERT INTO `collect` VALUES (11111111, 'f2', '陕西周至绿心猕猴桃新鲜包邮10大果当季整箱水果斤孕妇时令奇异果', 28.80, '喜欢的水果', '2222', '2');
INSERT INTO `collect` VALUES (11111111, 'f3', '粉面沙甜苹果宝宝刮泥婴儿老年人吃的孕妇新鲜棉绵红星水果红香蕉', 23.90, '喜欢的水果', '3333', '3');
INSERT INTO `collect` VALUES (11111111, 'f3', '粉面沙甜苹果宝宝刮泥婴儿老年人吃的孕妇新鲜棉绵红星水果红香蕉', 22.89, '喜欢的水果', '2222', '4');
INSERT INTO `collect` VALUES (11111111, 'f3', '粉面沙甜苹果宝宝刮泥婴儿老年人吃的孕妇新鲜棉绵红星水果红香蕉', 22.13, '喜欢的水果', '1111', '5');
INSERT INTO `collect` VALUES (123456, 'f3', '粉面沙甜苹果宝宝刮泥婴儿老年人吃的孕妇新鲜棉绵红星水果红香蕉', 22.13, '喜欢的水果', '3333', '6');
