INSERT INTO `dingdan` VALUES (1, '4444', '2022-1-20', '18267826172', 66.99, '微信', '11111111', '已关闭', '102400', '广东省深圳市光明区东周社区', '顺丰', 'dsfhnf', NULL, '智利车厘子礼盒装大樱桃水果新鲜 尝鲜 J级(26-28mm) 125g', 1);
INSERT INTO `dingdan` VALUES (2, '4444', '2022-1-8', '19177297788', 23.99, '支付宝', '11111111', '待发货', '731000', '广西省玉林市第一人民医院', '顺丰', 'sdfdrfc', NULL, '阳光玫瑰葡萄 新鲜水果 晴王葡萄 香印青提 1斤试吃装', 1);
INSERT INTO `dingdan` VALUES (3, '4444', '2022-1-24', '19177297788', 12.99, '微信', '11111111', '待评价', '467000', '广东省广州市黄埔区广州科学城109号', '顺丰', 'dcscfsedf', NULL, '京觅优选 香菜 火锅食材 调味食材 新鲜安全 100g 京东植物工厂 日', 1);
INSERT INTO `dingdan` VALUES (4, '4444', '2022-2-10', '19177297788', 33.45, '微信', '11111111', '已发货', '667490', '山东省淄博市', '邮政', 'fcdsfc', NULL, '密农人家 鲜嫩的圆白菜 绿甘蓝新鲜蔬菜 口感脆嫩 500g 健康轻食', 1);
INSERT INTO `dingdan` VALUES (5, '4444', '2022-2-10', '18267826172', 12.00, '微信', '11111111', '已完成', '334566', '上海市浦东新区人民政府', '邮政', 'Fsefcdes', NULL, '焦作温县铁棍山药2.5kg 沙土铁棍山药 怀山药淮山药新鲜蔬菜轻', 1);
INSERT INTO `dingdan` VALUES (6, '4444', '2022-1-11', '15622337823', 23.99, '微信', '123456', '待付款', '228800', '陕西省宝鸡市人名商场', '圆通', '12dewf', NULL, '【活鲜 顺丰】乳山地区 生蚝 三倍体新鲜保活 生蚝 烧烤食材 生鲜贝', 1);
INSERT INTO `dingdan` VALUES (11, '4444', '2022-1-11', '15622337823', 44.00, '微信', '11111111', '待付款', '228800', '陕西省宝鸡市人名商场', '圆通', 'fcsfcfc', NULL, '双汇 国产肘花无淀粉火腿肠520g 冷藏猪肘香肠烤肠 开袋即食', 1);
