<template>
  <div id="scene">
    <div class="container">
      <div
        class="classify"
        @mouseover="classifyBtn = true"
        @mouseout="classifyBtn = false"
      >
        <span>全部分类</span>
        <div class="classify-detail" v-show="classifyBtn">
        <!-- <div class="classify-detail"> -->
          <ul>
            <li
              class="menu-item"
              v-for="(item, index) in menuList"
              :key="index"
              @mouseover="tabChange(index)"
              @mouseout="selected = -1"
              @click="toFruit(item)"
            >
              <i :class="'item_icon' + index"></i>
              <p>{{ item.text }}</p>
              <div class="branch">
                <span>{{ item.branch1 }}</span
                ><span>{{ item.branch2 }}</span
                ><span>{{ item.branch3 }}</span>
              </div>
              <div class="bian"></div>
              <div class="menu-detail" v-show="selected==index" :style="'top:'+top+'px;'">
                <div
                  class="menu-box"
                  v-for="(items, index) in foodList"
                  :key="index"
                >
                  <span v-for="item in items" :key="item">{{ item }}</span>
                </div>
              </div>
            </li>
          </ul>
        </div>
      </div>

      <div class="scene-detail">
        <router-link to="/">首页</router-link>
        <router-link to="/youxuan">优选推荐</router-link>
        <router-link to="/tejia">当天特价</router-link>
        <router-link to="/shichi">鲜产试吃</router-link>
      </div>
      <!-- 品质保障 -->
      <div class="pinzhi">
        <i class="iconfont icon-zuanshi"></i>

        <span>品质保障</span>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  name: "Scene",
  components: {},
  props: [""],
  data() {
    return {
      top:40,
      activeName: "",
      tabPosition: "left",
      foodList:[],
      selected: -1,
      classifyBtn: false,
      menuList: [
        {
          text: "新鲜水果",
          branch1: "草莓",
          branch2: "水蜜桃",
          branch3: "车厘子",
        },
        {
          text: "海鲜水产",
          branch1: "海鲜礼盒",
          branch2: "鱼类",
          branch3: "贝类",
        },
        {
          text: "精选肉类",
          branch1: "鸡翅",
          branch2: "猪肋排",
          branch3: "牛排",
        },
        {
          text: "冷饮冻食",
          branch1: "酸奶",
          branch2: "冰淇淋",
          branch3: "牛奶",
        },
        {
          text: "蔬菜蛋品",
          branch1: "水培蔬菜",
          branch2: "玉米",
          branch3: "蛋品",
        },
      ],
    };
  },
  created() {},
  methods: {
    tabChange(index) {
      this.selected = index;
      this.top=-index*80;
      if(index ==0){
        this.foodList= [
        [
          "热销水果 >",
          "苹果",
          "葡萄/提子",
          "奇异果/猕猴桃",
          "橙子",
          "梨",
          "蓝莓",
          "柠檬",
          "百香果",
          "美国橙",
          "火龙果",
          "西柚",
          "水果礼盒",
        ],
        [
          "时令水果 >",
          "柚子",
          "冬枣",
          "车厘子/樱桃",
          "水蜜桃",
          "杏",
          "李子",
          "香瓜",
          "哈密瓜",
          "西瓜",
          "琵琶",
          "杨梅",
          "草莓",
          "柑橘",
          "石榴",
          "无花果",
          "柿子",
          "甘蔗",
          "金桔",
          "鲜槟榔",
        ],
        [
          "热带鲜果 >",
          "芒果",
          "菠萝/凤梨",
          "榴莲",
          "香蕉",
          "百香果",
          "山竹",
          "木瓜",
          "龙眼",
          "牛油果",
          "波罗蜜",
          "椰子",
          "火龙果",
          "莲雾",
          "番石榴/芭乐",
          "龙宫果",
          "火参果",
          "杨桃",
          "红毛丹",
        ],
        [
          "知名品牌 >",
          "佳沛",
          "都乐",
          "佳农",
          "怡颗莓",
          "宏辉果蔬",
          "新奇士",
          "爱奇果",
          "珍享",
          "展卉",
        ],
        [
          "地标水果 >",
          "山东网纹瓜",
          "百色芒果",
          "洛川苹果",
          "新疆哈密瓜",
          "阿克苏苹果",
          "烟台红富士",
          "蒙自石榴",
          "沾化冬枣",
          "西峡猕猴桃",
          "美国车厘子",
          "台湾凤梨",
          "进口水果",
          "东北姑娘果",
          "赣南脐橙",
        ],
        [
          "新奇特 >",
          "红心猕猴桃",
          "丑苹果",
          "黄心西瓜",
          "蛇皮果",
          "鲜核桃",
          "软籽石榴",
          "秋月梨",
          "有机水果",
          "鲜果礼盒",
        ],
      ]
      }else if(index==1){
        this.foodList=[
        ['鱼类 >','三文鱼','雪鱼','带鱼','黄鱼/黄花鱼','金枪鱼','巴沙鱼','鲳鱼','鲈鱼','鳗鱼',
        '鲽鱼 >','胖头鱼','更多'],
        ['虾类','红虾','白虾','虾仁','北极甜虾','黑虎虾','大龙虾','小龙虾','竹节虾','皮皮虾','基围虾','更多'],
        ['蟹类 >','大闸蟹','帝王蟹','俊子蟹','面包蟹/黄金蟹','青蟹','珍宝蟹','红毛蟹','醉蟹','香辣蟹','更多'],
        ['贝类 >','生蚝','鲍鱼','扇贝','蛤/蚬子','螺','蛏子','北极贝','蚌','贝柱','更多'],
        ['海参 >','即食海参','淡干海参','速发海参','冻干海参','蒸食海参','盐渍海参','调味海参','辽参','特级海参','更多'],
        ['海产干货 >','干贝','墨鱼干','鱿鱼干','虾皮','海带','海蛎干','花胶','银鱼干','蛤蜊干','海参','更多'],
        ['知名品牌 >','大洋世家','獐子岛','禧美','三都港','晓芹','海晏堂'],
        ['地标产品 >','阿根廷红虾','厄瓜多尔白虾','舟山带鱼','查干湖鱼','丹东蚬子','福建鲍鱼','宁波醉泥螺','大闸蟹'],
        ['特色海产 >','海外直采','活鲜','鱿鱼','墨鱼','甲鱼','章鱼','笔管鱼','鳄鱼肉','娃娃鱼','海鲜方便菜','麻辣海鲜','八爪鱼'],
      ]
      }else if(index ==2){
        this.foodList=[
        ['猪肉>','肋排','猪蹄','五花肉','汤骨/棒骨','猪肘','梅花肉片','猪排/猪扒','里脊','猪腿肉','猪肉馅','脊骨','更多'],
        ['牛肉>','牛排','牛腩','牛腱子','牛里脊','牛肉片/卷','牛尾','牛肋条','牛蹄筋','牛肉串','牛骨','筋头巴脑','更多'],
        ['羊肉>','羊肋排','羊肉片/卷','羊腿','羊蝎子','羊肉块','羊肉串','整羊','羊杂','西式羊排','羊肉馅','更多'],
        ['鸡肉>','鸡翅','整鸡','鸡胸肉','鸡腿','鸡爪','鸡肉块','鸡胗/鸡肫','鸡柳','鸡排','柴鸡','老母鸡','大公鸡','更多'],
        ['鸭肉>','鸭腿','鸭胸','鸭胗/鸭肫','鸭掌','鸭脖','鸭舌','鸭翅','老鸭','更多'],
        ['地标产品>','内蒙古牛羊肉','宁夏羊肉','北京油鸡','台湾烤肠','宣威火腿','哈尔滨红肠'],
        ['知名品牌>','双汇','泰森','科尔沁','蒙都','精气神','百年栗园','恒都','蒙羊'],
        ['安心工艺>','原切肉','调理肉','冷鲜肉','冷藏熟食','有机肉'],
        ['新奇特>','鹅肉','鸽肉','知了猴','蚕蛹','鹿肉','火鸡','年肉礼盒','野鸡'],
        ['内脏类>','肝','肺','肠','肚','心','腰子','鞭宝','更多']
      ];
      }else if(index ==3){
        this.foodList=[
        ['面点>','手抓饼','水饺','云吞','汤圆/元宵','包子','面条','馒头','年糕','月饼','烧麦','肠粉','更多'],
        ['方便速食>','方便菜','方便主食','即食卤味','培根','火腿','薯条','鸡米花','鸡肉块','鸡柳','更多'],
        ['饮品甜品>','冰激凌','饮料','果汁','酸奶','鲜奶','酸菌','蛋糕','更多'],
        ['火锅丸料>','牛肉丸','鱼豆腐','鱼丸','火锅肠','墨鱼丸','火锅饺','包心丸','方便火锅','低温火锅料','更多'],
        ['烘焙食材>','奶酪','黄油','芝士','淡奶油','蛋挞','披萨','早餐面包'],
        ['知名品牌>','船歌渔水饺','正大食品','湾仔码头','思念','三全','广州酒家利口福','天福号','哈根达斯'],
        ['烧烤季>','羊肉','牛肉','鸡肉','猪肉','鸽肉/蚕蛹','海鲜','蔬菜','主食'],
        ['舌尖美食>','船歌鱼水饺','东北酸菜','串串香','松茸','石屏豆腐','冬笋'],
        ['方便菜单>','鱼香肉丝','宫保鸡丁','佛跳墙','红烧肉','小南国','湘鄂情','新雅大厨','福成鲜到家'],
      ];
      }else if(index ==4){
        [
        ['叶菜类>','生菜','菜心','西兰花','菠菜','上海青/油菜','芥蓝','白菜','甘蓝/卷心菜','芹菜','韭菜','茼蒿','香菜','茴香','芝麻菜','更多'],
        ['根茎类>','山药','萝卜','地瓜/红薯','土豆/洋芋','芋头','莲藕','百合','芦笋','更多'],
        ['鲜菌菇>','香菇','松茸','鸡枞菌','牛肝菌','杏鲍菇','木耳/银耳','黑松露菌','平菇','更多'],
        ['茄果瓜类>','玉米','黄瓜','西红柿','南瓜','茄子','四季豆','苦瓜','豇豆','更多'],
        ['葱姜蒜椒>','葱姜','蒜椒','香料'],
        ['半加工菜>','泡菜','豆制品','沙拉菜','酸菜','方便火锅'],
        ['蛋类>','鸡蛋','鸭蛋','鸽子蛋','鹅蛋','鹌鹑蛋','松花蛋/皮蛋','喜蛋','咸蛋','咸蛋黄','更多'],
        ['地标产品>','建水烧豆腐','温县铁棍山药','桥头地瓜','板栗红薯','六鳌红薯','高邮咸鸭蛋','白洋淀咸鸭蛋','辛集烤鸭蛋','霍山鲜百合','兰州百合'],
        ['新奇特>','水培蔬菜','富硒地瓜','乌鸡蛋','野鸡蛋','鸡胚蛋','香椿芽','荠菜','薄荷','紫苏','冰草','山野菜','有机蔬菜']
      ];
      }
    },
    toFruit(item) {
      this.$router.push({ path: `/fruit/${item.text}` });
    },
  },
};
</script>
<style lang='sass'>
@import './scss/scene.scss'
</style>